Revit 2027 API
IDuctPressureDropServer.Calculate Method
 Calculate the duct pressure drop.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
void Calculate(
	DuctPressureDropData data
)
Sub Calculate (
	data As DuctPressureDropData
)
void Calculate(
	DuctPressureDropData^ data
)
abstract Calculate :
        data : DuctPressureDropData -> unit
Parameters
data DuctPressureDropData
 The input and output data of the calculation.
See Also
Reference
IDuctPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace